ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC54608/LPC54608_Blinky/board/pin_mux.c
- {pin_num: M4, pin_signal: PIO0_16/FC4_TXD_SCL_MISO/CLKOUT/CTIMER1_CAP0/EMC_CSN(0)/ENET_TXD0/ADC0_4, label: 'J12[2]/P0_16-ADC0IN4'}
- {pin_num: M5, pin_signal: PIO0_31/FC0_CTS_SDA_SSEL0/SD_D(2)/CTIMER0_MAT1/SCT0_OUT3/TRACEDATA(0)/ADC0_5, label: 'J12[4]/P0_31-ADC0IN5'}
- {pin_num: N3, pin_signal: PIO1_0/FC0_RTS_SCL_SSEL1/SD_D(3)/CTIMER0_CAP2/SCT0_GPI4/TRACECLK/ADC0_6, label: 'J12[6]/P0_31-ADC0IN5'}
- {pin_num: N12, pin_signal: PIO1_17/ENET_MDIO/FC8_RXD_SDA_MOSI/SCT0_OUT4/CAN1_TD/EMC_BLSN(0), label: 'J9[4]/P1_17-CAN1_TD'}
- {pin_num: P11, pin_signal: PIO1_22/FC8_RTS_SCL_SSEL1/SD_CMD/CTIMER2_MAT3/SCT0_GPI5/FC4_SSEL3/EMC_CKE(1), label: 'J13[1]/P1_22-CT2MAT3'}
- {pin_num: P3, pin_signal: PIO2_0/FC0_RXD_SDA_MOSI/CTIMER1_CAP0/ADC0_7, label: 'J12[8]/P2_0-ADC0IN7-PMOD2_INTR'}
- {pin_num: P4, pin_signal: PIO2_1/FC0_TXD_SCL_MISO/CTIMER1_MAT0/ADC0_8, label: 'J9[17]/P2_1-CT1MAT0'}
- {pin_num: P10, pin_signal: PIO2_17/LCD_CLKIN/USB1_UP_LED/USB1_OVERCURRENTN/CTIMER1_CAP1/FC8_RXD_SDA_MOSI, label: 'J13[20]/P2_17-CT1CAP1-FC8_RXD'}
- {pin_num: H14, pin_signal: PIO2_27/LCD_VD(9)/FC9_SCK/FC3_SSEL2, label: 'J17[2]/P2_27-CT_RSTn'}
- {pin_num: C10, pin_signal: PIO3_2/LCD_VD(16)/FC9_RXD_SDA_MOSI/CTIMER1_MAT2, label: 'J13[11]/P3_2-FC9_MOSI-CT1MAT2'}
- {pin_num: A3, pin_signal: PIO3_10/SCT0_OUT3/CTIMER3_MAT0/EMC_DYCSN(1)/TRACEDATA(0), label: 'J13[7]/P3_10-CT3MAT0'}
- {pin_num: L2, pin_signal: PIO3_12/SCT0_OUT8/CTIMER3_CAP0/CLKOUT/EMC_CLK(1)/TRACECLK, label: 'J12[9]/P3_12-CLKOUT'}
- {pin_num: E1, pin_signal: PIO3_16/FC8_RXD_SDA_MOSI/SD_D(4), label: 'J12[3]/P3_16-GPIO_SPI_CS2'}
- {pin_num: K1, pin_signal: PIO3_17/FC8_TXD_SCL_MISO/SD_D(5), label: 'JS25[1]/P3_17-FC8_TXD'}
- {pin_num: M6, pin_signal: PIO3_18/FC8_CTS_SDA_SSEL0/SD_D(6)/CTIMER4_MAT0/CAN0_TD/SCT0_OUT5, label: 'J10[4]/P3_17-FC8_TXD'}
- {pin_num: J3, pin_signal: PIO3_19/FC8_RTS_SCL_SSEL1/SD_D(7)/CTIMER4_MAT1/CAN0_RD/SCT0_OUT6, label: 'J10[2]/P3_19-CAN0_RD'}
- {pin_num: N2, pin_signal: PIO3_20/FC9_SCK/SD_CARD_INT_N/CLKOUT/SCT0_OUT7, label: 'J9[9]/P3_20-FC9_SCK'}
- {pin_num: P5, pin_signal: PIO3_21/FC9_RXD_SDA_MOSI/SD_BACKEND_PWR/CTIMER4_MAT3/UTICK_CAP2/ADC0_9, label: 'J9[13]/P3_21-FC9_MOSI'}
- {pin_num: N5, pin_signal: PIO3_22/FC9_TXD_SCL_MISO/ADC0_10, label: 'J9[11]/P3_21-FC9_MISO'}
- {pin_num: K5, pin_signal: PIO3_26/SCT0_OUT0/FC4_RXD_SDA_MOSI/EMC_A(15), label: 'J13[15]/P3_26-FC4_RXD'}
- {pin_num: P14, pin_signal: PIO3_27/SCT0_OUT1/FC4_TXD_SCL_MISO/EMC_A(16), label: 'J13[13]/P3_26-FC4_TXD'}
- {pin_num: M11, pin_signal: PIO3_28/SCT0_OUT2/FC4_CTS_SDA_SSEL0/EMC_A(17), label: 'JS26[1]/P3_28-FC4_CTS_SDAX'}
- {pin_num: L13, pin_signal: PIO3_29/SCT0_OUT3/FC4_RTS_SCL_SSEL1/EMC_A(18), label: 'J13[14]/P3_29-FC4_RTS_SCLX'}
- {pin_num: K13, pin_signal: PIO3_30/FC9_CTS_SDA_SSEL0/SCT0_OUT4/FC4_SSEL2/EMC_A(19), label: 'J9[15]/P3_30-FC9_SSELn0'}
- {pin_num: J14, pin_signal: PIO3_31/FC9_RTS_SCL_SSEL1/SCT0_OUT5/CTIMER4_MAT2/SCT0_GPI0/EMC_A(20), label: 'U14[4]/P3_31-SCT0_OUT5_CT4MAT2'}
- {pin_num: H13, pin_signal: PIO4_0/FC6_CTS_SDA_SSEL0/CTIMER4_CAP1/SCT0_GPI1/EMC_CSN(1), label: 'J17[3]/P4_0-CT_INTR'}
- {pin_num: D9, pin_signal: PIO4_4/FC4_SSEL3/FC0_RTS_SCL_SSEL1/SCT0_GPI5/EMC_DYCSN(3), label: 'J13[19]/P4_4'}
- {pin_num: E10, pin_signal: PIO4_5/FC9_CTS_SDA_SSEL0/FC0_CTS_SDA_SSEL0/CTIMER4_MAT3/SCT0_GPI6/EMC_CKE(2), label: 'J13[9]/P4_5-CT4MAT3'}
- {pin_num: D10, pin_signal: PIO4_6/FC9_RTS_SCL_SSEL1/SCT0_GPI7/EMC_CKE(3), label: 'J12[1]/P4_6-FC9_SSELn1'}
- {pin_num: A14, pin_signal: PIO4_7/CTIMER4_CAP3/USB0_PORTPWRN/USB0_FRAME/SCT0_GPI0, label: P4_7}
- {pin_num: A12, pin_signal: PIO4_9/ENET_TXD1/FC2_RXD_SDA_MOSI/USB1_PORTPWRN/USB1_FRAME/SCT0_GPI2, label: 'U29[2]/P4_9-USB1_PORTPWRn'}
- {pin_num: N13, pin_signal: RESET, label: 'J15[1]/nRESET_TRGT'}
- {pin_num: L12, pin_signal: RTCXIN, label: Y4}
- {pin_num: K11, pin_signal: RTCXOUT, label: Y4}
- {pin_num: G3, pin_signal: USB1_AVDD0, label: +3.3V_USB_ENET}
- {pin_num: H1, pin_signal: USB1_AVDD1, label: +3.3V_USB_ENET}
- {pin_num: F2, pin_signal: USB1_AVSSC, label: GND}
- {pin_num: J1, pin_signal: USB1_AVSSTX3V3, label: GND}
- {pin_num: F1, pin_signal: USB1_REXT, label: GND}
- {pin_num: N11, pin_signal: VBAT0, label: VDD_TARGE}
- {pin_num: H5, pin_signal: VD1_00, label: JS22}
- {pin_num: E6, pin_signal: VDD0, label: VDD_TARGET_IC}
- {pin_num: E8, pin_signal: VDD1, label: VDD_TARGET_IC}
- {pin_num: F5, pin_signal: VDD2, label: VDD_TARGET_IC}
- {pin_num: G5, pin_signal: VDD3, label: VDD_TARGET_IC}
- {pin_num: J12, pin_signal: VDD4, label: VDD_TARGET_IC}
- {pin_num: L11, pin_signal: VDD5, label: VDD_TARGET_IC}
- {pin_num: N6, pin_signal: VDDA, label: VDD_TARGET}
- {pin_num: L6, pin_signal: VPP0, label: VDD_TARGET_IC}
- {pin_num: P6, pin_signal: VREFP, label: 'JS23[1]'}
- {pin_num: N4, pin_signal: VREFN, label: 'JS22[2]'}
- {pin_num: B3, pin_signal: VSS0, label: GND}
- {pin_num: D7, pin_signal: VSS1, label: GND}
- {pin_num: D8, pin_signal: VSS2, label: GND}
- {pin_num: E11, pin_signal: VSS3, label: GND}
- {pin_num: J5, pin_signal: VSS4, label: GND}
- {pin_num: L5, pin_signal: VSSA, label: GND}
- {pin_num: K4, pin_signal: XTAL1, label: Y2}
- {pin_num: J4, pin_signal: XTAL2, label: Y2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: P2, peripheral: SWD, signal: SWO, pin_signal: PIO0_10/FC6_SCK/CTIMER2_CAP2/CTIMER2_MAT0/FC1_TXD_SCL_MISO/SWO/ADC0_0, identifier: '', mode: inactive}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

